InformationRegisters/ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеДвоичныхДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Comment>Хранение ссылки на объект Не позволит штатными средствами удалить объект без очистки всех прикреплений</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрисоединенныхФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХраненияФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоХраненияПрикрепленныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширениеИмениФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МестоХраненияПрикрепленныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МестоХраненияПрикрепленныхФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийДисковыйРесурс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ХранилищеФайлов/Ext/ManagerModule.bsl
// © Primus1C  25.06.2023  НАЧАЛО ►

///////////////////////////////////////////////////////
Процедура СоздатьКаталогНаСервере (ИмяКаталога, Отказ, Сообщение) Экспорт
	
	Попытка
		СоздатьКаталог(ИмяКаталога);
	Исключение
	   	Сообщение=ОписаниеОшибки();
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьФайлыНаСервере(ПапкаДляУдаления, ИмяФайла, Отказ, Сообщение) Экспорт
	
	Попытка
		УдалитьФайлы(ПапкаДляУдаления,ИмяФайла); //удалить файл
		//если папка пуста, то удалить папку
		л_МассивОставшихсяФайлов = НайтиФайлы(ПапкаДляУдаления, "*.*", Ложь);
		Если л_МассивОставшихсяФайлов.ВГраница() = -1 Тогда 
			УдалитьФайлы(ПапкаДляУдаления);
		КонецЕсли;
	Исключение
		Отказ = Истина;
	    Сообщение=ОписаниеОшибки();
	КонецПопытки;    
	
КонецПроцедуры

Процедура СохранитьФайлНаСервере (ВнутреннийАдресСервера, ПолноеИмяСохраняемогоФайла) Экспорт  
	
	л_ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ВнутреннийАдресСервера);
	л_ДвоичныеДанныеФайла.Записать(ПолноеИмяСохраняемогоФайла); 
	
КонецПроцедуры // СохранитьФайлНаСервере()
///////////////////////////////////////////////////////

Функция ПолучитьКлючЗаписи(Ссылка, ПараметрыФайла, Настройка="") Экспорт
	
	л_Отбор = Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,НазначениеФайла");
	л_Ключ = СоздатьКлючЗаписи(л_Отбор);
	
	Если ПустаяСтрока(Настройка) Тогда 
		//Настройка = РегистрыСведений.НастройкаХраненияФайлов.ПолучитьПоследнее(); 
		Настройка = ОбщегоНазначенияПовтИсп.НастройкаХраненияФайлов();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда 
		л_Отбор.ОбъектУИД			= Ссылка.УникальныйИдентификатор();
		л_Отбор.ОбъектСсылка		= Ссылка;
		л_Отбор.МестоХраненияФайлов	= Настройка.МестоХраненияФайлов;
		л_Отбор.ИмяФайла			= ПараметрыФайла.ИмяБезРасширения;
		л_Отбор.РасширениеИмениФайла= ПараметрыФайла.Расширение;
		л_Отбор.НазначениеФайла		= ПараметрыФайла.Назначение;
		л_Ключ = СоздатьКлючЗаписи(л_Отбор);
	КонецЕсли;

	Возврат л_Ключ;                   
	
КонецФункции // ПолучитьКлючЗаписи(Ссылка,ИмяФайла)()

Функция ПолучитьЗапись(Ключ) Экспорт 
	
	л_Запись = СоздатьМенеджерЗаписи();
	л_Запрос = Новый Запрос;
	л_Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ХранилищеФайловСрезПоследних.Период КАК Период,
	|	ХранилищеФайловСрезПоследних.ОбъектУИД КАК ОбъектУИД,
	|	ХранилищеФайловСрезПоследних.ОбъектСсылка КАК ОбъектСсылка,
	|	ХранилищеФайловСрезПоследних.МестоХраненияФайлов КАК МестоХраненияФайлов,
	|	ХранилищеФайловСрезПоследних.ИмяФайла КАК ИмяФайла,
	|	ХранилищеФайловСрезПоследних.РасширениеИмениФайла КАК РасширениеИмениФайла,
	|	ХранилищеФайловСрезПоследних.Автор КАК Автор,
	|	ХранилищеФайловСрезПоследних.ХранилищеДвоичныхДанных КАК ХранилищеДвоичныхДанных,
	|	ХранилищеФайловСрезПоследних.ПутьФайла КАК ПутьФайла,
	|	ХранилищеФайловСрезПоследних.РазмерФайла КАК РазмерФайла,
	|	ХранилищеФайловСрезПоследних.НазначениеФайла КАК НазначениеФайла
	|ИЗ
	|	РегистрСведений.ХранилищеФайлов.СрезПоследних(
	|			&НаДату,
	|			ИмяФайла = &ИмяФайла
	|				И МестоХраненияФайлов = &МестоХраненияФайлов
	|				И ОбъектУИД = &ОбъектУИД
	|				И ОбъектСсылка = &ОбъектСсылка
	|				И НазначениеФайла = &НазначениеФайла) КАК ХранилищеФайловСрезПоследних";
	л_Запрос.УстановитьПараметр("ИмяФайла",				Ключ.ИмяФайла);
	л_Запрос.УстановитьПараметр("МестоХраненияФайлов",	Ключ.МестоХраненияФайлов);
	л_Запрос.УстановитьПараметр("ОбъектУИД",			Ключ.ОбъектУИД);
	л_Запрос.УстановитьПараметр("ОбъектСсылка",			Ключ.ОбъектСсылка);
	л_Запрос.УстановитьПараметр("НаДату",				ТекущаяДата());     
	л_Запрос.УстановитьПараметр("НазначениеФайла",		Ключ.НазначениеФайла);
	л_Рез = л_Запрос.Выполнить().Выгрузить();
	
	Если л_Рез.Количество() > 0 Тогда 
		ЗаполнитьЗначенияСвойств(л_Запись, л_Рез[0]);
		л_Запись.Прочитать();
	КонецЕсли;
	
	Возврат л_Запись;         
	
КонецФункции // ПолучитьЗапись()

Функция ПолучитьМассивФайловОбъекта(Ссылка, Назначение = Неопределено) Экспорт
	
	//л_Строка = ""; 
	//л_Разделитель = ";  "; 
	л_Массив = Новый Массив;
	л_Запрос = Новый Запрос;
	л_Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                 |	ХранилищеФайлов.ИмяФайла КАК ИмяФайла,
	                 |	ХранилищеФайлов.РасширениеИмениФайла КАК РасширениеИмениФайла,
	                 |	ХранилищеФайлов.ОбъектУИД КАК ОбъектУИД,
	                 |	ХранилищеФайлов.ОбъектСсылка КАК ОбъектСсылка,
	                 |	ХранилищеФайлов.МестоХраненияФайлов КАК МестоХраненияФайлов,
	                 |	ХранилищеФайлов.Автор КАК Автор,
	                 |	ХранилищеФайлов.НазначениеФайла КАК НазначениеФайла
	                 |ИЗ
	                 |	РегистрСведений.ХранилищеФайлов.СрезПоследних КАК ХранилищеФайлов
	                 |ГДЕ
	                 |	ХранилищеФайлов.ОбъектСсылка = &ОбъектСсылка"; 
	Если ЗначениеЗаполнено(Назначение) Тогда
		л_Запрос.Текст = л_Запрос.Текст + " И ХранилищеФайлов.НазначениеФайла = &Назначение";
		л_Запрос.УстановитьПараметр("Назначение", Назначение);
	КонецЕсли;
	л_Запрос.УстановитьПараметр("ОбъектСсылка", Ссылка);
	Выборка = л_Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
		л_Массив.Добавить(Новый Структура("ИмяФайла,РасширениеИмениФайла, ОбъектУИД, НазначениеФайла", 
										Выборка.ИмяФайла, Выборка.РасширениеИмениФайла, Выборка.ОбъектУИД, Выборка.НазначениеФайла)); 	
	КонецЦикла;
	Возврат л_Массив;
	
КонецФункции // ПолучитьМассивФайловОбъекта()

Функция ПолучитьМассивФайлов(Ссылка, Назначение) Экспорт
	
	//л_Строка = ""; 
	//л_Разделитель = ";  "; 
	л_Массив = Новый Массив;
	л_Запрос = Новый Запрос;
	л_Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                 |	ХранилищеФайлов.ИмяФайла КАК ИмяФайла,
	                 |	ХранилищеФайлов.РасширениеИмениФайла КАК РасширениеИмениФайла,
	                 |	ХранилищеФайлов.ОбъектУИД КАК ОбъектУИД,
	                 |	ХранилищеФайлов.ОбъектСсылка КАК ОбъектСсылка,
	                 |	ХранилищеФайлов.МестоХраненияФайлов КАК МестоХраненияФайлов,
	                 |	ХранилищеФайлов.Автор КАК Автор,
	                 |	ХранилищеФайлов.НазначениеФайла КАК НазначениеФайла
	                 |ИЗ
	                 |	РегистрСведений.ХранилищеФайлов.СрезПоследних КАК ХранилищеФайлов
	                 |ГДЕ
	                 |	ХранилищеФайлов.ОбъектСсылка = &ОбъектСсылка"; 
	Если ЗначениеЗаполнено(Назначение) Тогда
		л_Запрос.Текст = л_Запрос.Текст + " И ХранилищеФайлов.НазначениеФайла = &Назначение";
		л_Запрос.УстановитьПараметр("Назначение", Назначение);
	КонецЕсли;
	л_Запрос.УстановитьПараметр("ОбъектСсылка", Ссылка);
	л_ТЗ = л_Запрос.Выполнить().Выгрузить();
	Для Каждого л_Стр Из л_ТЗ Цикл 
	//	л_Строка = л_Строка + л_Стр[0] + л_Стр[1] + л_Разделитель;  
		л_Массив.Добавить(л_Стр[0] + л_Стр[1]);
	КонецЦикла;
	//Возврат Лев(л_Строка, СтрДлина(л_Строка) - СтрДлина(л_Разделитель)); 
	Возврат л_Массив;
	
КонецФункции // ПолучитьМассивФайлов()

Функция ПолучитьСтрокуФайлов(Ссылка, Назначение) Экспорт
	
	л_Строка = ""; 
	л_Разделитель = ";  ";
	л_Запрос = Новый Запрос;
	л_Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХранилищеФайлов.ИмяФайла КАК ИмяФайла,
	|	ХранилищеФайлов.РасширениеИмениФайла КАК РасширениеИмениФайла
	|ИЗ
	|	РегистрСведений.ХранилищеФайлов КАК ХранилищеФайлов
	|ГДЕ
	|	ХранилищеФайлов.ОбъектСсылка = &ОбъектСсылка"; 
	Если ЗначениеЗаполнено(Назначение) Тогда
		л_Запрос.Текст = л_Запрос.Текст + " И ХранилищеФайлов.НазначениеФайла = &Назначение";
		л_Запрос.УстановитьПараметр("Назначение", Назначение);
	КонецЕсли;
	л_Запрос.УстановитьПараметр("ОбъектСсылка", Ссылка);
	л_ТЗ = л_Запрос.Выполнить().Выгрузить();
	Для Каждого л_Стр Из л_ТЗ Цикл 
		л_Строка = л_Строка + л_Стр[0] + л_Стр[1] + л_Разделитель;
	КонецЦикла;
	Возврат Лев(л_Строка, СтрДлина(л_Строка) - СтрДлина(л_Разделитель)); 
	
КонецФункции // ПолучитьСтрокуФайлов()

Функция ИмяПапкиОбъекта(СсылкаОбъект, НастройкаХраненияФайлов) Экспорт

	//получить имя общей папки на сервере
	л_ОбщаяПапка = НастройкаХраненияФайлов.КаталогФайлов;
	Если Прав(л_ОбщаяПапка, 1) = "\" Тогда 
		л_ПапкаОбъекта = л_ОбщаяПапка + Формат(ТекущаяДата(), "ДФ=""ггггММдд""") + "\" + СсылкаОбъект.УникальныйИдентификатор();
	Иначе 
		л_ПапкаОбъекта = л_ОбщаяПапка + "\" + Формат(ТекущаяДата(), "ДФ=""ггггММдд""") + "\" + СсылкаОбъект.УникальныйИдентификатор();
	КонецЕсли;
	Возврат  л_ПапкаОбъекта;

КонецФункции 

Функция ПриведенноеИмя(ИмяФайлаСРасширением)
	
	Если Сред(ИмяФайлаСРасширением, СтрДлина(ИмяФайлаСРасширением)-3, 1) = "." Тогда
		поз = 4;
	Иначе
		поз = 5;
	КонецЕсли;
	Расширение = Прав(ИмяФайлаСРасширением, поз);
	ПриведенноеИмя = Лев(ИмяФайлаСРасширением, СтрДлина(ИмяФайлаСРасширением)-поз);
	ПриведенноеИмя = СтрЗаменить(ПриведенноеИмя, "    ", "_");
	ПриведенноеИмя = СтрЗаменить(ПриведенноеИмя, "   ", "_");
	ПриведенноеИмя = СтрЗаменить(ПриведенноеИмя, "  ", "_");
	ПриведенноеИмя = СтрЗаменить(ПриведенноеИмя, " ", "_");

	Возврат Новый Структура("Имя,Расширение", ПриведенноеИмя, Расширение);
	
КонецФункции 

//добавление (загрузка) файлов на диск сервера
Процедура СохранитьФайлНаДиск(Знач АдресВременногоХранилища, знач п_НастройкаХраненияФайлов, знач п_Объект, п_Файл, Отказ, ТекстСообщения="") Экспорт  

	л_ПапкаОбъекта = ИмяПапкиОбъекта(п_Объект, п_НастройкаХраненияФайлов);
	
	//Создать папку, если такой не существует
	СоздатьКаталогНаСервере (л_ПапкаОбъекта, Отказ, ТекстСообщения);
	Если Отказ Тогда  
		Возврат;
	КонецЕсли;
	
	ПриведенноеИмя = ПриведенноеИмя(п_Файл.Имя);
	
	//получить полное имя файла на сервере
	//л_ПолноеИмяСохраняемогоФайла = л_ПапкаОбъекта + "\" + п_Файл.Имя;
	л_ПолноеИмяСохраняемогоФайла = л_ПапкаОбъекта + "\" + ПриведенноеИмя.Имя + ПриведенноеИмя.Расширение;
	
	//проверить существование такого файла на сервере
	л_СохраняемыйФайл = Новый Файл(л_ПолноеИмяСохраняемогоФайла);
	Если л_СохраняемыйФайл.Существует() Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Файл с именем %1%2%1 уже существует в базе данных'; en = 'A file named %1%2%1 already exists in the database'"), "'", ПриведенноеИмя.Имя + ПриведенноеИмя.Расширение);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

 	//копировать файл из временного хранилища базы на диск сервера
	Попытка
		СохранитьФайлНаСервере(АдресВременногоХранилища, л_ПолноеИмяСохраняемогоФайла);
		п_Файл.ПолноеИмя		= л_ПолноеИмяСохраняемогоФайла;    
		п_Файл.Имя              = л_ПолноеИмяСохраняемогоФайла; 
		п_Файл.ИмяБезРасширения	= ПриведенноеИмя.Имя;
		п_Файл.Путь				= л_ПапкаОбъекта;
	Исключение
		ТекстСообщения 			= ОписаниеОшибки();
		Отказ 					= Истина;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПоместитьФайлВоВременноеХранилище(Знач КлючЗаписи, АдресХранилища) 
	
	л_Запись = ПолучитьЗапись(КлючЗаписи);
	
	Если л_Запись.МестоХраненияФайлов = Перечисления.МестоХраненияПрикрепленныхФайлов.ИнформационнаяБаза Тогда 
		
		л_ДвоичныеДанныеФайла = л_Запись.ХранилищеДвоичныхДанных.Получить();
		АдресХранилища = ПоместитьВоВременноеХранилище(л_ДвоичныеДанныеФайла);
		
	ИначеЕсли л_Запись.МестоХраненияФайлов = Перечисления.МестоХраненияПрикрепленныхФайлов.ОбщийДисковыйРесурс Тогда 
		
		//л_НастройкаХраненияФайлов = РегистрыСведений.НастройкаХраненияФайлов.ПолучитьПоследнее(л_Запись.Период); 
		л_НастройкаХраненияФайлов = ОбщегоНазначенияПовтИсп.НастройкаХраненияФайлов();
		Если ЗначениеЗаполнено(л_НастройкаХраненияФайлов) Тогда 
			л_ПолноеИмяФайла = л_Запись.ПутьФайла + "\" + л_Запись.ИмяФайла + л_Запись.РасширениеИмениФайла; //л_НастройкаХраненияФайлов.КаталогФайлов+"\"+л_Запись.Объект+"\"+л_Запись.ИмяФайла+л_Запись.РасширениеИмениФайла;
			АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(л_ПолноеИмяФайла));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьАдресФайлаВоВременномХранилище(Знач КлючЗаписи) Экспорт 
	
	л_Адрес = "";
	ПоместитьФайлВоВременноеХранилище(КлючЗаписи, л_Адрес);
	Возврат л_Адрес; 
	
КонецФункции 

Процедура ДобавитьЗаписьВРегистр(знач ДатаЗагрузки, знач п_ОбъектСсылка, знач п_Файл, знач п_НастройкаХраненияФайлов, п_Отказ, п_ИзменитьСуществующуюЗапись=Ложь, п_Запись="", ТекстСообщения="") Экспорт 
	
	л_Запись 				= СоздатьМенеджерЗаписи();
	л_МестоХраненияФайлов 	= п_НастройкаХраненияФайлов.МестоХраненияФайлов;
	Если п_ИзменитьСуществующуюЗапись Тогда 
		л_Запись = п_Запись;
	Иначе 
		л_Запись.Период					= ДатаЗагрузки;
		л_Запись.Активность				= Истина;
		л_Запись.ОбъектУИД				= п_ОбъектСсылка.УникальныйИдентификатор();
		л_Запись.ОбъектСсылка			= п_ОбъектСсылка;
		л_Запись.ИмяФайла				= п_Файл.ИмяБезРасширения;
		л_Запись.МестоХраненияФайлов	= л_МестоХраненияФайлов;
		л_Запись.РасширениеИмениФайла	= п_Файл.Расширение;
		л_Запись.Автор					= ПараметрыСеанса.Пользователь; 
		Если п_Файл.Свойство("Назначение") Тогда
			л_Запись.НазначениеФайла	= п_Файл.Назначение;	
		КонецЕсли;
		л_Запись.ПутьФайла				= п_Файл.Путь;
		л_Запись.РазмерФайла            = п_Файл.Размер;
	КонецЕсли;
	
	ИмяВременногоФайла = КаталогВременныхФайлов() + п_Файл.Имя; 
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(п_Файл.АдресВременногоХранилища);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	п_Файл.ПолноеИмя = ИмяВременногоФайла; 
	
	Если л_МестоХраненияФайлов = Перечисления.МестоХраненияПрикрепленныхФайлов.ИнформационнаяБаза Тогда 
		Если п_НастройкаХраненияФайлов.ИспользоватьСжатие Тогда 
			л_Запись.ХранилищеДвоичныхДанных = Новый ХранилищеЗначения(Новый ДвоичныеДанные (п_Файл.ПолноеИмя), Новый СжатиеДанных(п_НастройкаХраненияФайлов.МетодСжатия));
		Иначе 
			л_Запись.ХранилищеДвоичныхДанных = Новый ХранилищеЗначения(Новый ДвоичныеДанные (п_Файл.ПолноеИмя));
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		л_Запись.Записать(п_ИзменитьСуществующуюЗапись);
		п_Запись = л_Запись;
		ТекстСообщения = СтрШаблон( НСтр("ru = 'Файл %1 успешно загружен!'; en = 'File %1 uploaded successfully!'"), п_Файл.ИмяБезРасширения + п_Файл.Расширение);
	Исключение
		п_Отказ	= Истина;
		ТекстСообщения = "Ошибка в процедуре РС 'ХранилищеФайлов' - 'ДобавитьЗаписьВРегистр(...)'" + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

//Удаление файлов
Процедура УдалитьФайлСДиска(знач КлючЗаписи, Отказ, ТекстСообщения="") Экспорт  
	
	л_Запись = ПолучитьЗапись(КлючЗаписи);	
	//л_НастройкаХраненияФайлов	= РегистрыСведений.НастройкаХраненияФайлов.ПолучитьПоследнее(л_Запись.Период);
	л_НастройкаХраненияФайлов	= ОбщегоНазначенияПовтИсп.НастройкаХраненияФайлов();
	л_ПапкаДляУдаления			= л_Запись.ПутьФайла + "\"; //л_НастройкаХраненияФайлов.КаталогФайлов+"\"+л_Запись.Объект+"\";
	л_ИмяФайла					= л_Запись.ИмяФайла + л_Запись.РасширениеИмениФайла;
	
	Если л_ИмяФайла = "" Тогда
	    Возврат;
	КонецЕсли;

	УдалитьФайлыНаСервере(л_ПапкаДляУдаления, л_ИмяФайла, Отказ, ТекстСообщения);
	Если НЕ Отказ Тогда 
		ТекстСообщения = СтрШаблон( НСтр("ru = 'Файл %1 успешно удален!'; en = 'File %1 deleteded successfully!'"), л_ИмяФайла);
	КонецЕсли;;

КонецПроцедуры

Процедура УдалитьЗаписьИзРегистра(знач КлючЗаписи, Отказ, ТекстСообщения="") Экспорт     
	
	л_Запись = ПолучитьЗапись(КлючЗаписи);
	Если л_Запись.Выбран() Тогда 
		л_Запись.Удалить();
	Иначе 
		ТекстСообщения = НСтр("ru = 'Запись не найдена!'; en = 'Record not found!'");
		Отказ = Истина;
	КонецЕсли;  
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
